---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.Welds
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.Welds

Inserts a weld on one of the available edges of the model elements to be connected.